tutorials/testcases/flowOverCylinder/Re100/templates/overset_steady/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       37991;
    }
    inner
    {
        type            bellerophon;
        inGroups        1(bellerophon);
        nFaces          120;
        startFace       38111;
        matchTolerance  0.0001;
        transform       unknown;
        donorZone       outer;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          38370;
        startFace       38231;
    }
    inlet
    {
        type            patch;
        nFaces          85;
        startFace       76601;
    }
    outlet
    {
        type            patch;
        nFaces          85;
        startFace       76686;
    }
    sides
    {
        type            patch;
        nFaces          300;
        startFace       76771;
    }
    outer
    {
        type            bellerophon;
        inGroups        1(bellerophon);
        nFaces          103;
        startFace       77071;
        matchTolerance  0.0001;
        transform       unknown;
        donorZone       inner;
    }
)

// ************************************************************************* //
