tutorials/testcases/flowOverCylinder/Re100/templates/overset_steady/system/holeCutterDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

oversetZone     inner;

holeSource      triSurfaceAndRay;

triSurfaceAndRayCoeffs
{
    surfaceName "inner.stl";
    ray         (1 1e-5 0);
}

// ************************************************************************* //
